blog/React/state.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-05-18 Wed 19:15 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>State with React hooks</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Morgan Walsh">
<meta name="description" content="Learn about component state and the component lifecycle."
>
<meta name="keywords" content="React JavaScript HTML">
<link rel='stylesheet' href='/css/style.css' type='text/css' />
</head>
<body>
<div id="preamble" class="status">
<nav>
  <a id='toggle'>&equiv;</a>
  <a class='nav-link' href='/'>Home</a>
  <a class='nav-link' href='/blog'>Blog</a>
  <a class='nav-link' href='http://github.com/MrWalshy'>GitHub</a>
</nav>
</div>
<div id="content">
<header>
<h1 class="title">State with React hooks</h1>
<p class="subtitle">An introduction to component state</p>
</header><p>
In React, we often want to create dynamic components where the data inside them could change. Using props, we cannot do this unless we re-render the whole component manually. React components have a built-in <code>state</code> object for managing data that is subject to change, when this object changes the component will be re-rendered.
</p>

<div id="outline-container-org2de9b3a" class="outline-2">
<h2 id="org2de9b3a">Adding state to a component</h2>
<div class="outline-text-2" id="text-org2de9b3a">
<p>
Hooks were added to React in version 16.8, these allow function components to access their state and lifecycle.
</p>

<blockquote>
<p>
Class components are generally not needed anymore due to this.
</p>
</blockquote>

<p>
There are multiple hooks available in React that can be imported from <code>react</code>:
</p>

<ul class="org-ul">
<li><code>useState()</code></li>
<li><code>useEffect()</code></li>
<li><code>useContext()</code></li>
<li><code>useRef()</code></li>
<li><code>useMemo()</code></li>
</ul>

<p>
There are 3 rules with React hooks:
</p>

<ol class="org-ol">
<li>Hooks can only be called inside function components</li>
<li>Hooks can only be called at the top level of a component</li>
<li>Hooks cannot be conditional</li>
</ol>

<p>
The <code>useState</code> hook is for tracking state in a function component, the data that is subject to change.
</p>

<p>
The first step is to import the <code>useState</code> hook:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="font-weight: bold;">import</span> { useState } from <span style="font-style: italic;">'react'</span>;
</pre>
</div>

<p>
Once we have imported the function, we can initialise state in components using it. <code>useState</code> accepts the initial state and returns two values:
</p>

<ol class="org-ol">
<li>The current state</li>
<li>A function for updating said state</li>
</ol>

<div class="org-src-container">
<pre class="src src-js"><span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">UserEditForm</span> = (props) =&gt; {

  <span style="font-weight: bold;">const</span> [<span style="font-weight: bold; font-style: italic;">age</span>, <span style="font-weight: bold; font-style: italic;">setAge</span>] = useState(props.age);

  <span style="font-weight: bold;">return</span> (
    &lt;form&gt;
      &lt;h3&gt;{props.user.username} | Edit profile&lt;/h3&gt;
      {<span style="font-weight: bold; font-style: italic;">/*</span>
<span style="font-weight: bold; font-style: italic;">         The input is data that changes during the lifecycle of the component, this represents state and will be explored in a different article.</span>
<span style="font-weight: bold; font-style: italic;">       */</span>}
       &lt;label htmlFor=<span style="font-style: italic;">"age"</span>&gt;Age: &lt;/label&gt;
       &lt;input type=<span style="font-style: italic;">"number"</span>
              id=<span style="font-style: italic;">"age"</span>
              defaultValue={age} /&gt;
     &lt;/form&gt;
  );
}
</pre>
</div>

<p>
Once the state is initialised, it can be used anywhere in the component.
</p>
</div>
</div>

<div id="outline-container-org3ba2563" class="outline-2">
<h2 id="org3ba2563">Updating state</h2>
<div class="outline-text-2" id="text-org3ba2563">
<p>
To update state, we must not access the variable directly. Instead, we should use the mutator function provided by the <code>useState</code> hook.
</p>

<div class="org-src-container">
<pre class="src src-js" id="org1f677ca"><span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">UserEditForm</span> = (props) =&gt; {

  <span style="font-weight: bold;">const</span> [<span style="font-weight: bold; font-style: italic;">age</span>, <span style="font-weight: bold; font-style: italic;">setAge</span>] = useState(props.user.age);

  <span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">updateAge</span> = (event) =&gt; setAge(event.target.value);

  <span style="font-weight: bold;">return</span> (
    &lt;form&gt;
      &lt;h3&gt;{props.user.username} | Edit profile&lt;/h3&gt;
      {<span style="font-weight: bold; font-style: italic;">/*</span>
<span style="font-weight: bold; font-style: italic;">         The input is data that changes during the lifecycle of the component, this represents state and will be explored in a different article.</span>
<span style="font-weight: bold; font-style: italic;">       */</span>}
       &lt;label htmlFor=<span style="font-style: italic;">"age"</span>&gt;Age: &lt;/label&gt;
       &lt;input type=<span style="font-style: italic;">"number"</span>
              id=<span style="font-style: italic;">"age"</span>
              defaultValue={age}
              onChange={<span style="font-weight: bold; text-decoration: underline;">this</span>.updateAge} /&gt;
     &lt;/form&gt;
  );
}
</pre>
</div>

<p>
If we then pass a prop named <code>user</code>, with the username and age properties, to the component - <code>&lt;UserEditForm user={user} /&gt;</code> - it will render a form for us
with the ability to modify the value of age. Given the following object:
</p>

<div class="org-src-container">
<pre class="src src-js" id="org95cb2dc"><span style="font-weight: bold;">const</span> <span style="font-weight: bold; font-style: italic;">user</span> = {
  username: <span style="font-style: italic;">"Fred"</span>,
  age: 32
};
</pre>
</div>

<p>
was passed as a prop to the edit form component, it would render the following HTML:
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
  <small>
    Copyright 2022 Morgan Walsh.<br />
    Last updated 2022-05-18 Wed 19:12. <br />
    Built with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9). <br />
    <a href="/html/bug-report.html">Submit a bug report</a>
  </small>
</footer>
<script src='/js/navbar.js'></script>
</div>
</body>
</html>
